#include <windows.h>
#include <stdio.h>
#include <locale.h>
#include <conio.h>
#include "pch.h"
#include <iostream>
#include <math.h>


int main(void)
{
	//std::cout << "Hello World!\n";
	printf("Hello World!\n");
	setlocale(LC_ALL, "cp1251");
	int a;
	scanf_s("%i", &a);
	if (0>a||100<a)
	{
		printf("Only 0-100"); return 0;
	}
	if (50 <= a && 70 > a)
	{
		if (50 <= a && 60 > a)
		{
			printf("E"); return 0;
		}
		else
		{
			printf("D"); return 0;
		}
	}
	else
	{
		if (70 <= a && 100 > a)
		{
			if (80 <= a && 100 >= a)
			{
				if (90 <= a && 100 > a)
				{
					printf("A"); return 0;
				}
				else
				{
					printf("B"); return 0;
				}
			}
			else
			{
				printf("C"); return 0;
			}
		}
		else
		{
			printf("F"); return 0;
		}
	}







	//getch();
	return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
